# 데이터프레임

- 행과 열로 구성된 표 형태의 데이터

In [3]:
import pandas as pd

# 데이터 확인

In [6]:
df = pd.read_csv("C:/Users/ITSC/Desktop/ai_project/data_analysis/data/gapminder.tsv", sep = "\t")

In [9]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [10]:
type(df)

pandas.core.frame.DataFrame

## 행

- 가로로 나열되는 각 데이터의 단위
    - 로우(row) 또는 케이스(case)라고도 불림

In [11]:
df.shape # (행, 열)

(1704, 6)

In [12]:
df.tail() # 맨 끝 5개 데이터 확인

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

## 열

- 세로로 나열되는 속성
    - 컬럼(column) 또는 변수(variable)라고도 불림

In [13]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

### 판다스와 파이썬 자료형

- 문자열
    - 파이썬 : string
    - 판다스 : object
    
- 정수
    - 파이썬 : int
    - 판다스 : int64
    
- 실수
    - 파이썬 : float
    - 판다스 : float64
    
- datetime
    - 파이썬 : datetime
    - 판다스 : datetime64

In [14]:
# 데이터프레임 값의 자료형 확인
df.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

# 데이터 추출

In [20]:
df["country"]

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [21]:
type(df["country"])

pandas.core.series.Series

In [22]:
country_se = df["country"]

In [23]:
# 시리즈 데이터 앞부분 확인
country_se.head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [25]:
# 시리즈 데이터 뒷부분 확인
country_se.tail()

1699    Zimbabwe
1700    Zimbabwe
1701    Zimbabwe
1702    Zimbabwe
1703    Zimbabwe
Name: country, dtype: object

In [28]:
# 데이터프레임에서 여러 컬럼 추출
subset = df[["country", "continent", "year"]]

In [29]:
subset.head()

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

In [30]:
type(subset)

pandas.core.frame.DataFrame

## 행 단위 데이터 추출

- loc
    - 인덱스를 기준으로 행 데이터 추출
    
- iloc
    - 행 번호를 기준으로 행 데이터 추출

### loc

- 인덱스(index) : 값의 위치를 나타낸 값
    - 데이터프레임을 만들면 자동으로 인덱스 번호가 부여됨
        - 현재 gapminder데이터의 왼쪽에 세로로 나열된 0, 1, 2, 3, ...... 가 인덱스

In [31]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [32]:
df.loc[0]

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object

In [33]:
df.loc[99]

country      Bangladesh
continent          Asia
year               1967
lifeExp          43.453
pop            62821884
gdpPercap    721.186086
Name: 99, dtype: object

In [34]:
# ord() : 문자를 전달하면 해당 문자의 유니코드값을 반환
# chr() : 특정 문자의 유니코드 값을 전달하면 해당 문자를 반환
ord("a"), ord("z")

(97, 122)

In [35]:
for i in range(97, 123):
    print(chr(i), end = " ")

a b c d e f g h i j k l m n o p q r s t u v w x y z

In [36]:
df_index = pd.DataFrame({"value" : [i for i in range(26)]},
                        index = [chr(i) for i in range(97, 123)])

In [37]:
df_index.head()

   value
a      0
b      1
c      2
d      3
e      4

In [38]:
df_index.loc["a"]

value    0
Name: a, dtype: int64

In [39]:
df_index.loc["z"]

value    25
Name: z, dtype: int64

In [42]:
# 여러 행 추출
df_index.loc[["a", "z"]]

   value
a      0
z     25

In [44]:
# 하나의 행을 데이터프레임으로 추출
df_index.loc[["a"]]

   value
a      0

In [45]:
# loc으로 마지막행 추출하기
df.loc[1703]

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [47]:
# 마지막 행의 인덱스를 확인해야 loc으로 마지막행을 추출할 수 있음
df.tail(1)

       country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [51]:
last_row = df.shape[0] - 1

In [52]:
df.loc[last_row]

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

### iloc

- 행 번호를 기준으로 행 데이터 추출

In [53]:
df.iloc[0]

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object

In [54]:
df.loc[99], '', df.iloc[99]

(country      Bangladesh
 continent          Asia
 year               1967
 lifeExp          43.453
 pop            62821884
 gdpPercap    721.186086
 Name: 99, dtype: object,
 '',
 country      Bangladesh
 continent          Asia
 year               1967
 lifeExp          43.453
 pop            62821884
 gdpPercap    721.186086
 Name: 99, dtype: object)

In [57]:
# iloc으로 마지막 행 추출
df.iloc[-1]

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [59]:
df_index.iloc[0]

value    0
Name: a, dtype: int64

In [60]:
df_index.iloc[10]

value    10
Name: k, dtype: int64

## 행과 열 추출

In [61]:
# 데이터프레임.loc[행, 열]
df.loc[:, "year"]

0       1952
1       1957
2       1962
3       1967
4       1972
        ...
1699    1987
1700    1992
1701    1997
1702    2002
1703    2007
Name: year, Length: 1704, dtype: int64

In [63]:
# loc으로 전체행, year컬럼과 pop 컬럼 추출
df.loc[:, ["year", "pop"]].head()

   year       pop
0  1952   8425333
1  1957   9240934
2  1962  10267083
3  1967  11537966
4  1972  13079460

In [66]:
# 데이터프레임.iloc[행, 열]
df.iloc[:, [2, 4, -1]].head()

   year       pop   gdpPercap
0  1952   8425333  779.445314
1  1957   9240934  820.853030
2  1962  10267083  853.100710
3  1967  11537966  836.197138
4  1972  13079460  739.981106

In [67]:
df.iloc[[0, 1, 2], [2, 4, -1]]

   year       pop   gdpPercap
0  1952   8425333  779.445314
1  1957   9240934  820.853030
2  1962  10267083  853.100710

In [68]:
df.iloc[:5, :3]

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

In [69]:
df.iloc[:, 0:6:2].head()

       country  year       pop
0  Afghanistan  1952   8425333
1  Afghanistan  1957   9240934
2  Afghanistan  1962  10267083
3  Afghanistan  1967  11537966
4  Afghanistan  1972  13079460

In [70]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [71]:
# df에서 0번째, 99번째, 999번째 행 데이터, 0번째, 3번째, 5번째 열 데이터 추출
df.iloc[[0, 99, 999], [0, 3, 5]]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [72]:
df.loc[[0, 99, 999], ["country", "lifeExp", "gdpPercap"]]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

# 기초적인 통계 계산

In [73]:
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846988
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

## 그룹화한 데이터의 평균 구하기

In [75]:
df.groupby("year")["lifeExp"].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [76]:
df.groupby(["year", "continent"])[["lifeExp", "gdpPercap"]].mean()

                  lifeExp     gdpPercap
year continent
1952 Africa     39.135500   1252.572466
     Americas   53.279840   4079.062552
     Asia       46.314394   5195.484004
     Europe     64.408500   5661.057435
     Oceania    69.255000  10298.085650
1957 Africa     41.266346   1385.236062
     Americas   55.960280   4616.043733
     Asia       49.318544   5787.732940
     Europe     66.703067   6963.012816
     Oceania    70.295000  11598.522455
1962 Africa     43.319442   1598.078825
     Americas   58.398760   4901.541870
     Asia       51.563223   5729.369625
     Europe     68.539233   8365.486814
     Oceania    71.085000  12696.452430
1967 Africa     45.334538   2050.363801
     Americas   60.410920   5668.253496
     Asia       54.663640   5971.173374
     Europe     69.737600  10143.823757
     Oceania    71.310000  14495.021790
1972 Africa     47.450942   2339.615674
     Americas   62.394920   6491.334139
     Asia       57.319269   8187.468699
     Europe     70.775033  12479.575246
     Oceania    71.910000  16417.333380
1977 Africa     49.580423   2585.938508
     Americas   64.391560   7352.007126
     Asia       59.610556   7791.314020
     Europe     71.937767  14283.979110
     Oceania    72.855000  17283.957605
1982 Africa     51.592865   2481.592960
     Americas   66.228840   7506.737088
     Asia       62.617939   7434.135157
     Europe     72.806400  15617.896551
     Oceania    74.290000  18554.709840
1987 Africa     53.344788   2282.668991
     Americas   68.090720   7793.400261
     Asia       64.851182   7608.226508
     Europe     73.642167  17214.310727
     Oceania    75.320000  20448.040160
1992 Africa     53.629577   2281.810333
     Americas   69.568360   8044.934406
     Asia       66.537212   8639.690248
     Europe     74.440100  17061.568084
     Oceania    76.945000  20894.045885
1997 Africa     53.598269   2378.759555
     Americas   71.150480   8889.300863
     Asia       68.020515   9834.093295
     Europe     75.505167  19076.781802
     Oceania    78.190000  24024.175170
2002 Africa     53.325231   2599.385159
     Americas   72.422040   9287.677107
     Asia       69.233879  10174.090397
     Europe     76.700600  21711.732422
     Oceania    79.740000  26938.778040
2007 Africa     54.806038   3089.032605
     Americas   73.608120  11003.031625
     Asia       70.728485  12473.026870
     Europe     77.648600  25054.481636
     Oceania    80.719500  29810.188275

## 그룹화한 데이터 개수 세기

In [77]:
df.groupby("continent")["country"].nunique() # country의 종류 수

continent
Africa      52
Americas    25
Asia        33
Europe      30
Oceania      2
Name: country, dtype: int64

In [78]:
df.groupby("continent")["country"].value_counts() # 각 country별 데이터 개수

continent  country
Africa     Algeria           12
           Angola            12
           Benin             12
           Botswana          12
           Burkina Faso      12
                             ..
Europe     Switzerland       12
           Turkey            12
           United Kingdom    12
Oceania    Australia         12
           New Zealand       12
Name: country, Length: 142, dtype: int64

In [79]:
df.groupby("continent")["country"].count() # continent별 데이터 개수

continent
Africa      624
Americas    300
Asia        396
Europe      360
Oceania      24
Name: country, dtype: int64

# 데이터 생성

In [80]:
pd.Series(["banana", 42])

0    banana
1        42
dtype: object

In [81]:
pd.Series(["Wes McKinney", "Creator of Pandas"])

0         Wes McKinney
1    Creator of Pandas
dtype: object

In [82]:
pd.Series(["Wes McKinney", "Creator of Pandas"], index = ["Person", "Who"])

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [84]:
scientists = pd.DataFrame(
    data = {"Occupation" : ["Chemist", "Statistician"],
            "Born" : ["1970-07-25", "1876-06-13"],
            "Died" : ["1958-04-16", "1937-10-16"],
            "Age" : [37, 61]},
    index = ["Rosaline Franklin", "William Gosset"],
    columns = ["Occupation", "Born", "Age", "Died"])

In [85]:
scientists

                     Occupation        Born  Age        Died
Rosaline Franklin       Chemist  1970-07-25   37  1958-04-16
William Gosset     Statistician  1876-06-13   61  1937-10-16

# 시리즈 다루기

In [86]:
scientists.loc["William Gosset"]

Occupation    Statistician
Born            1876-06-13
Age                     61
Died            1937-10-16
Name: William Gosset, dtype: object

In [87]:
type(scientists.loc["William Gosset"])

pandas.core.series.Series

In [88]:
scientists.loc["William Gosset"].index

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [89]:
scientists.loc["William Gosset"].values

array(['Statistician', '1876-06-13', 61, '1937-10-16'], dtype=object)

In [90]:
scientists.loc["William Gosset"].keys()

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [91]:
scientists.loc["William Gosset"]["Occupation"]

'Statistician'

## 시리즈에 기초통계 메서드 사용

In [96]:
scientists["Age"].mean() # 평균

49.0

In [97]:
scientists["Age"].min() # 최솟값

37

In [98]:
scientists["Age"].max() # 최댓값

61

In [99]:
scientists["Age"].std() # 표준편차

16.97056274847714

In [100]:
scientists = pd.read_csv("./data/scientists.csv")

In [101]:
scientists.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [103]:
scientists.shape

(8, 5)

In [104]:
scientists.dtypes

Name          object
Born          object
Died          object
Age            int64
Occupation    object
dtype: object

In [105]:
scientists["Age"].max()

90

In [106]:
scientists["Age"].mean()

59.125

## 필터링

- 평균보다 나이가 많은 사람의 데이터 추출

In [107]:
ages = scientists["Age"]

In [108]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [109]:
ages[ages > ages.mean()] # 평균보다 나이가 많은 사람의 데이터 추출

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [110]:
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [111]:
# True와 False의 배열을 입력하면 True에 해당하는 데이터만 출력
ages[[True, True, False, False, True, True, False, True]]

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

## 시리즈 연산

In [112]:
# 시리즈 더하기 시리즈
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [113]:
# 시리즈 곱하기 시리즈
ages * ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [114]:
# 시리즈 더하기 숫자
ages + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [115]:
# 시리즈 곱하기 숫자
ages * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [116]:
# 길이가 서로 다른 시리즈를 연산하면 인덱스가 일치한 데이터만 계산함
ages + pd.Series([1, 100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [117]:
# 인덱스 연산은 눈에 보이는 순서대로 연산하는 것이 아니라 인덱스가 일치하는 값끼리 연산
ages.sort_index(ascending = False)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [118]:
ages * 2, '', ages + ages.sort_index(ascending = False)

(0     74
 1    122
 2    180
 3    132
 4    112
 5     90
 6     82
 7    154
 Name: Age, dtype: int64,
 '',
 0     74
 1    122
 2    180
 3    132
 4    112
 5     90
 6     82
 7    154
 Name: Age, dtype: int64)

## 데이터프레임 필터링

In [119]:
scientists.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [120]:
# 평균보다 나이가 많은 데이터 필터링
scientists[scientists["Age"] > scientists["Age"].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [123]:
scientists["Age"] > scientists["Age"].mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

## 데이터프레임 연산

In [124]:
scientists * 2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

## 날짜 데이터 처리

In [125]:
scientists.dtypes

Name          object
Born          object
Died          object
Age            int64
Occupation    object
dtype: object

In [126]:
scientists["Born"]

0    1920-07-25
1    1876-06-13
2    1820-05-12
3    1867-11-07
4    1907-05-27
5    1813-03-15
6    1912-06-23
7    1777-04-30
Name: Born, dtype: object

In [127]:
pd.to_datetime(scientists["Born"], format = "%Y-%m-%d")

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [128]:
pd.to_datetime(scientists["Died"], format = "%Y-%m-%d")

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [129]:
# 데이터프레임에 컬럼 추가
scientists["born_dt"] = pd.to_datetime(scientists["Born"], format = "%Y-%m-%d")

In [131]:
scientists["died_dt"] = pd.to_datetime(scientists["Died"], format = "%Y-%m-%d")

In [132]:
scientists.head()

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14

In [133]:
scientists.dtypes

Name                  object
Born                  object
Died                  object
Age                    int64
Occupation            object
born_dt       datetime64[ns]
died_dt       datetime64[ns]
dtype: object

In [134]:
scientists["age_days"] = scientists["died_dt"] - scientists["born_dt"]

In [135]:
scientists.head()

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days

## 열 삭제

In [136]:
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt',
       'age_days'],
      dtype='object')

In [138]:
# axis = 1 : 실행방향(1 - 열, 0 - 행)
scientists.drop(["Age", "Born"], axis = 1)

,Name,Died,Occupation,born_dt,died_dt,age_days
0,Rosaline Franklin,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

In [139]:
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [140]:
dropped = scientists.drop(["Age"], axis = 1)

In [142]:
dropped.head()

,Name,Born,Died,Occupation,born_dt,died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days

In [143]:
# 원본 데이터에 바로 가공을 하려면
scientists.drop(["Age"], axis = 1, inplace = True)

In [144]:
scientists.head()

,Name,Born,Died,Occupation,born_dt,died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days

# 데이터 저장

In [145]:
# pickle로 저장
scientists.to_pickle("./scientists.pickle")

In [146]:
pd.read_pickle("./scientists.pickle")

,Name,Born,Died,Occupation,born_dt,died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

In [153]:
# csv로 저장
scientists.to_csv("scientists.csv", index = False)

In [154]:
pd.read_csv("scientists.csv")

,Name,Born,Died,Occupation,born_dt,died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

In [157]:
# excel 저장
scientists.to_excel("scientists.xlsx", index = False)

In [158]:
pd.read_excel("scientists.xlsx")

,Name,Born,Died,Occupation,born_dt,died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,16529
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422

# 데이터 연결

In [159]:
df1 = pd.read_csv("./data/concat_1.csv")
df2 = pd.read_csv("./data/concat_2.csv")
df3 = pd.read_csv("./data/concat_3.csv")

In [163]:
df1.head()

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [161]:
df2.head(1)

    A   B   C   D
0  a4  b4  c4  d4

In [162]:
df3.head(1)

    A   B   C   D
0  a8  b8  c8  d8

In [164]:
concat_df = pd.concat([df1, df2, df3])
concat_df

     A    B    C    D
0   a0   b0   c0   d0
1   a1   b1   c1   d1
2   a2   b2   c2   d2
3   a3   b3   c3   d3
0   a4   b4   c4   d4
1   a5   b5   c5   d5
2   a6   b6   c6   d6
3   a7   b7   c7   d7
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [165]:
new_row = pd.Series(["n1", "n2", "n3", "n4"])

In [166]:
new_row

0    n1
1    n2
2    n3
3    n4
dtype: object

In [167]:
pd.concat([df1, new_row])

     A    B    C    D    0
0   a0   b0   c0   d0  NaN
1   a1   b1   c1   d1  NaN
2   a2   b2   c2   d2  NaN
3   a3   b3   c3   d3  NaN
0  NaN  NaN  NaN  NaN   n1
1  NaN  NaN  NaN  NaN   n2
2  NaN  NaN  NaN  NaN   n3
3  NaN  NaN  NaN  NaN   n4

- 시리즈에는 열이름이 없기 때문에 새로운 열로 간주

In [169]:
new_row_df = pd.DataFrame([["n1", "n2", "n3", "n4"]], columns = ["A", "B", "C", "D"])
new_row_df

    A   B   C   D
0  n1  n2  n3  n4

In [170]:
pd.concat([df1, new_row_df])

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  n1  n2  n3  n4